{
  "Header": {
    "name": "Geisiel Melo",
    "dev": "Full Stack Developer",
    "description": "Building exceptional digital experiences is my specialty as a developer.",

    "options": {
      "about": {
        "title": "about",
        "href": "#about"
      },
      "experience": {
        "title": "experience",
        "href": "#experience"
      },
      "projects": {
        "title": "projects",
        "href": "#projects"
      }
    }
  },

  "About": {
    "title": "about",
    "paragraph": {
      "p1": "I’m someone driven by challenges and committed to delivering the best results in the shortest time possible. For me, it’s not just about creating something functional; I strive to go further, combining attractive design, intuitive usability, and flawless performance — both in the interface and the code.",
      "p2": "Currently, I work as a web developer at UniFTC, specializing in accessibility and performance. In recent months, I’ve been deeply involved in building websites, APIs, and integrations, ensuring that every project runs smoothly and provides users with a seamless and exceptional experience.",
      "p3": "My journey began by developing solutions for self-employed professionals and small business owners. That period was transformative, allowing me to explore various technologies and understand the unique needs of each client, shaping the way I approach projects today.",
      "p4": "In my free time, I enjoy recharging by playing games with friends or diving into great TV shows."
    }
  },

  "Experience": {
    "title": "experience",
    "cards": {
      "c1": {
        "start": "2024",
        "end": "Today",
        "title": "Full Stack Developer · UniFTC",
        "description": "Development of websites with a focus on accessibility and performance. | Creation of robust and functional APIs. | Integration of systems to ensure efficient communication between different platforms. | Ensuring that all projects deliver a seamless and exceptional experience to users. | Problem-solving and process optimization to keep projects running smoothly.",
        "tags": "SQL, TypeScript, Next, Nest, TailwindCSS, PHP",
        "href": ""
      },
      "c2": {
        "start": "2020",
        "end": "2024",
        "title": "Full Stack Developer · Freelancer",
        "description": "Full-stack development of web applications using modern technologies such as MongoDB, Express, React, Node, and TypeScript. | Development of APIs and interfaces with a focus on user experience enhancement. | Implementation of robust programming practices, including version control with Git. | Active participation in all stages of application development cycle, from planning to launch.",
        "tags": "MongoDB, Express, React, TailwindCSS, TypeScript",
        "href": ""
      },
      "c3": {
        "start": "2020",
        "end": "2022",
        "title": "Front-end Developer · Loja TrapStar",
        "description": "Developed, maintained, and deployed production code for client websites, primarily utilizing HTML, CSS, and JavaScript. | Collaborated  with the design team to promote a cohesive team environment and ensure consistent user experiences. | Performed quality tests to ensure cross browser compatibility, speed and responsiveness.",
        "tags": "HTML, CSS, JavaScript",
        "href": ""
      }
    }
  },

  "Projects": {
    "title": "Projects",
    "cards": {
      "c1": {
        "title": "Vacancies",
        "description": "Vacancies were created as an improved method for efficiently organizing your applications.",
        "image": "/img/vacancies.webp",
        "git": "https://github.com/GeisielMelo/vacancies",
        "live": "https://vacancies-client.vercel.app/",
        "tags": "Express, Mongodb, Node, React, Tailwind CSS"
      },
      "c2": {
        "title": "TMDb",
        "description": "An app created in my free time with the aim of being a front-end-only application powered by data from TheMovieDB.",
        "image": "/img/tmdb.webp",
        "git": "https://github.com/GeisielMelo/TMDb",
        "live": "https://tmdb.geisielmelo.vercel.app/",
        "tags": "Firebase, Lucide, React, Swiper, Tailwind CSS"
      },
      "c3": {
        "title": "Profile Visualizer",
        "description": "A more effective way to view user information through graphs and statistics.",
        "image": "/img/profilevizualizer.webp",
        "git": "https://github.com/GeisielMelo/Profile-visualizer",
        "live": "https://profile-visualizer.vercel.app/",
        "tags": "Node, React, Styled Components, Typescript"
      },
      "c4": {
        "title": "GNM-Chat",
        "description": "A complete chat platform where you can add contacts and send real-time messages, very simple to use and fully responsive.",
        "image": "/img/gnmchat.webp",
        "git": "https://github.com/GeisielMelo/GNM-Chat",
        "live": "https://gnm-chat.vercel.app/",
        "tags": "Firebase, Lucide, React, Tailwind CSS"
      }
    }
  }
}
